[{"response":"[Wikipedia Result]\n\n\nHarry Potter is a series of seven fantasy novels written by British author J. K. Rowling. The novels chronicle the lives of a young wizard, Harry Potter, and his friends, Ron Weasley and Hermione Granger, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's conflict with Lord Voldemort, a dark wizard who intends to become immortal, overthrow the wizard governing body known as the Ministry of Magic, and subjugate all wizards and Muggles.\n\n[DuckDuckGo Result]\n\n\nHarry Potter is a series of seven fantasy novels written by British author J. K. Rowling. The novels chronicle the lives of a young wizard, Harry Potter, and his friends, Ron Weasley and Hermione Granger, all of whom are students at Hogwarts School of Witchcraft and Wizardry. The main story arc concerns Harry's conflict with Lord Voldemort, a dark wizard who intends to become immortal, overthrow the wizard governing body known as the Ministry of Magic, and subjugate all wizards and Muggles. The series was originally published in English by Bloomsbury in the United Kingdom and Scholastic Press in the United States. A series of many genres, including fantasy, drama, coming-of-age fiction, and the British school story, the world of Harry Potter explores numerous themes and includes many cultural meanings and references. Major themes in the series include prejudice, corruption, madness, love, and death.\n\n[BookSearch Result]\n\n\nTitle: Harry Potter à l'école des sorciers\nAuthors: Joanne Kathleen Rowling\nPublished: 2023\nDescription: Le jour de ses onze ans, Harry Potter, un orphelin élevé par un oncle et une tante qui le détestent, voit son existence bouleversée. Un géant vient le chercher pour l'emmener à Poudlard, une école de sorcellerie ! Voler en balai, jeter des sorts, combattre les trolls : Harry révèle de grands talents. Mais un mystère entoure sa naissance et l'effroyable V., le mage dont personne n'ose prononcer le nom.\n\n[Wikidata Result]\n\n\n: No description available\n\n[Langsearch Result]\n\n\n\n• Harry Potter - Wikipedia\n  https://en.m.wikipedia.org/wiki/Harry_Potter?tid=312186056%2525252525252525253Ftid\n  harry potter article talk harry potter is a series of seven fantasy novels written by british author j. k. rowling . the novels chronicle the lives of a young wizard , harry potter , and his fri... [read more]\n\n• Harry Potter (character) - Wikipedia\n  https://en.m.wikipedia.org/wiki/Harry_Potter_(character)\n  harry potter ( character ) article talk harry james potter is the titular character of the harry potter series of novels by j. k. rowling . the plot of the seven - book series chronicles seven y... [read more]\n\n• Harry Potter | Harry Potter Wiki | Fandom\n  https://harrypotter.fandom.com/wiki/Harry_Potter\n  harry potter biographical information born 31 july 1980 [ 1 ] godric 's hollow , west country , england , great britain blood status half-blood [ 2 ] marital status married [... [read more]\n\n","query":"harry potter","timestamp":1744991138821},{"response":"[BookSearch Result]\n\n\nTitle: Shah Rukh Khan the King of Bollywood\nAuthors: Azhar ul Haque Sario\nPublished: 2025-04-17\nDescription: Dive into the extraordinary life of Shah Rukh Khan, Bollywood’s timeless king! This biography, Shah Rukh Khan: The King of Bollywood, traces the journey of a man who rose from a modest Delhi flat to global stardom. Born in 1965 amidst New Delhi’s wartime turmoil, Shah Rukh’s resilience was forged early. His childhood in Rajinder Nagar, shaped by his freedom-fighter father and magistrate mother, instilled ambition. Loss, like his grandmother’s passing, deepened his bond with sister Shehnaz, building empathy. Roaming Delhi’s vibrant streets sparked his imagination. At St. Columba’s School, he excelled as a hockey goalkeeper until a shoulder injury at 14 pivoted him to school plays. Mentors like Brother Eric D’Souza nurtured his newfound passion for acting. At Hansraj College, Shah Rukh balanced economics with starring roles in plays like Death of a Salesman. Training with Barry John at Theatre Action Group honed his craft. Delhi’s urban pulse—vendors, rickshaw drivers—inspired his creativity. His TV debut in Fauji (1989) made him a household name. Bollywood beckoned, and Deewana (1992) launched him as a star. Shah Rukh redefined heroism with anti-hero roles in Baazigar and Darr (1993). Dilwale Dulhania Le Jayenge (1995) cemented him as a romantic icon. As a producer, he founded Dreamz Unlimited and Red Chillies Entertainment, pioneering VFX with Main Hoon Na (2004). Off-screen, he hosted Kaun Banega Crorepati, toured globally, and inspired millions with his TED India talk. Family anchored him—wife Gauri, children Aryan, Suhana, and AbRam, and his iconic home, Mannat. His Meer Foundation supports acid attack survivors, while quiet donations aid education and child cancer care. Shah Rukh’s 2023 blockbuster Pathaan proved his enduring draw. At 60, he plans to direct by 2026, ensuring his legacy thrives. This book stands out by weaving Shah Rukh’s personal and professional milestones into a vivid narrative. Unlike other biographies, it dives deep into unseen moments—his childhood grief, Delhi’s influence, and mentorship’s role. It highlights his business savvy, from Kolkata Knight Riders to Red Chillies’ growth, and his discreet philanthropy. Using fresh research, like 1960s Delhi archives and St. Columba’s records, it paints a fuller picture. Shah Rukh’s story isn’t just about fame—it’s about grit, reinvention, and heart. This biography captures his essence, offering fans and newcomers a lens into what makes him Bollywood’s heartbeat. No other book blends his cultural impact, family life, and visionary ventures so seamlessly. Copyright Disclaimer: This book is independently produced and not affiliated with Shah Rukh Khan, his family, or associated entities. It is written under nominative fair use, relying on publicly available information and original research to celebrate his legacy.\n\n[OpenRouter Result]\n\n\n It seems like you're referring to the popular book series \"Harry Potter\" by J.K. Rowling. Here's a brief summary for those who might be unfamiliar:\n\nThe series follows the life of Harry Potter, an orphan who lives with his unloving aunt and uncle. On his eleventh birthday, he learns he is a wizard and is accepted into Hogwarts School of Witchcraft and Wizardry. At Hogwarts, he learns about his magical abilities, makes friends, and faces challenges.\n\nThe series is divided into seven books:\n\n1. Harry Potter and the Philosopher's Stone: Harry discovers he can speak Parseltongue, a language of snakes, and learns about the Philosopher's Stone that can create the Elixir of Life.\n\n2. Harry Potter and the Chamber of Secrets: A monstrous creature is terrorizing the school, and Harry discovers a chamber filled with the remains of victims from a century ago.\n\n3. Harry Potter and the Prisoner of Azkaban: A dangerous prisoner, Sirius Black, escapes from Azkaban and is after Harry.\n\n4. Harry Potter and the Goblet of Fire: A magical tournament, the Triwizard Tournament, takes place at Hogwarts. Harry becomes a contestant despite being too young for the competition.\n\n5. Harry Potter and the Order of the Phoenix: A new Defense Against the Dark Arts teacher, Dolores Umbridge, is appointed, and Harry forms the Dumbledore's Army to teach students defense against the Dark Arts.\n\n6. Harry Potter and the Half-Blood Prince: Harry discovers a book that is said to belong to the Half-Blood Prince, a former student known for his genius in Potions.\n\n7. Harry Potter and the Deathly Hallows: The final book in the series. Harry, Hermione, and Ron, along with Dumbledore's lost horcruxes, embark on a mission to defeat Voldemort.\n\nThe series is known for its intricate plot, complex characters, and magical world-building. It has been adapted into a successful film series as well.\n\n[Wikidata Result]\n\n\n: No description available\n\n[Langsearch Result]\n\n\n\n• Shah Rukh Khan Height, Age, Wife, Family, Children, Biography & More » StarsUnfolded\n  https://starsunfolded.com/shah-rukh-khan/#:~:text=Age:\n  shah rukh khan height , age , wife , children , family , biography quick info→ salary : rs . 45 crore / film age : 59 years height : 5 ’ 8 ” bio / wiki nickname ( s ) • srk • king khan • k... [read more]\n\n• Shahrukh Khan's Real Height - Join the Discussion\n  https://www.celebheights.com/s/Shahrukh-Khan-46991.html\n  shah rukh khan 's height 5ft 7 ½( 171 . 5 cm ) indian actor best known for films such as om shanti om , chak de ! india , swades : we , the people , dilwale dulhania le jayenge , darr and my name ... [read more]\n\n• Shah Rukh Khan’s Height, Age, Net Worth & Biography\n  https://www.heightcomparison.com/article/shah-rukh-khan/\n  shah rukh khan ’s height , age , net worth & biography shah rukh khan ’s height is 5 ’ 6 ” ( 169 cm ) . khan is regarded as one of the world 's most successful film stars . not to mention , he is ... [read more]\n\n","query":"how tall is shah rukh khan","timestamp":1744991167698}]